# LoadedFamilyIntegrityCheck Methods

---
The LoadedFamilyIntegrityCheck type exposes the following members.
| Name| Description
---|---|---
| CheckAllFamilies|
| CheckAllFamiliesSlow|
| CheckFamily|  Check that the loaded family has its content document.
Top
#### Reference
LoadedFamilyIntegrityCheck Class
Autodesk.Revit.DB Namespace